Revit 2027 API
ApplicationEntryPoint.GetRibbonPanels(String) Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override List<RibbonPanel> GetRibbonPanels(
	string tabName
)
Public Overrides Function GetRibbonPanels (
	tabName As String
) As List(Of RibbonPanel)
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	String^ tabName
) override
abstract GetRibbonPanels :
        tabName : string -> List<RibbonPanel>
override GetRibbonPanels :
        tabName : string -> List<RibbonPanel>
Parameters
tabName String
Return Value
List<RibbonPanel>
See Also
Reference
ApplicationEntryPoint Class
GetRibbonPanels Overload
Autodesk.Revit.UI.Macros Namespace